{"title":{"0":"[HIST 101] Professor Matthew Mooney","1":"Who willing to sell a chem155 add code for Spring2020.","2":"Anybody willing to show me around?","3":"homesick:(","4":"housing","5":"please help","6":"App that notifies SBCC students when class has open seat","7":"help:(","8":"Never Be A Biology Major at SBCC if You Plan on Transferring After 2 Years!","9":"Who here speaks esperanto?","10":"An Open Letter","11":"Academic Advising- Graduate School","12":"Stolen Schwinn Bike from BMS building","13":"Do Transcripts distinguish between Online vs Live Courses?","14":"Textbooks for Summer 2?","15":"Looking for female student accommodation from Mid May to Mid Aug 2019","16":"Summer classes","17":"Is anyone still on this sub? I’m trying to make new friends at CC, are there any interesting clubs or something that I should join?","18":"SBCC Internship Survey - $50 Amazon Gift Card","19":"How to meet hella ppl and party scene As a freshman ?","20":"Unofficial SBCC Discord Server","21":"Private and Discrete DC Escorts","22":"Looking for students to evaluate ideas on student-teacher relationships in American high schools","23":"Test","24":"Tropicana Gardens Room","25":"Please help me meet all of SBCC House Party Gurus!","26":"Intro to Cyber security","27":"Are the music practice rooms unlocked and open to all students? Or restricted to music majors only?","28":"does anyone have any information about communication classes @ sbcc","29":"Anyone use Lynda.com? I’m looking for the SBCC domain name to login to the app.","30":"Free workshop for students with disabilities!","31":"Best place to live if going to SBCC?","32":"SBCC Biological Sciences?","33":"Anyone currently in Math 150 with Jim?","34":"Five students visiting from the rainy UBC, any cool party around?","35":"Prospective international student looking to talk to some SBCC students about enrolling!","36":"Is Physics 121 offered over summer or only during the year?","37":"Do y'all feel as if Math 160 is a fairly manageable class?","38":"Does anyone know when the registration hold for a parking citation will lift?","39":"EMT Class?","40":"UCSB snow team","41":"What do you think about the school, socially?","42":"Santa Barbara Harbor SBCC shot","43":"Transferring to SBCC","44":"Chill SBCC students on fleek trying to keep the environment lit","45":"Summer Sublets","46":"Has anyone taken ENG 240? Can you point me to the syllabus?","47":"Audition - Looking for Trivia Night Hosts - Perfect Student Gig","48":"Good programs for students coming form overseas?","49":"Two foreigners looking for a party","50":"is anyone interested in dropping their EMT class for fall? PLEASE LET ME KNOW. DESPERATE","51":"Any swedes interested in practicing my Swedish with me? Can pay or help edit your papers in English in exchange!","52":"Is there is dorm?","53":"When does the courses work? And what are the process or scores needed for applying?","54":"I need tips!! First time college student","55":"Where to live my first year at SBCC.","56":"Energetic, communicative, easy to get along with, pretty looks and fit","57":"Salsa Dancing Team\/Club?","58":"League of Legends SBCC Team","59":"Vapors exiled like regular smokers","60":"Can I still sign up for classes?","61":"StudyHut - Now Available on the iOS App Store for UCSB and SBCC Students!","62":"anyone here play lax on the club team?","63":"Signed up for 3 classes during summer sessions (1 in first session, 2 in the second), but I can only pay for two?","64":"what is dual enrolment?","65":"Housing options?","66":"Will my fake id get taken in Santa Babara","67":"Where everyone at?!","68":"Has anybody seen a brown puppy???","69":"Any Klan members on campus?","70":"SB Global infosoft","71":"This sub seems dead, but... I'm staying at Tropicana Gardens for my first year and I put \"I choose to live an alcohol free lifestyle\" on my roommate matching profile. Do people taje that seriously?","72":"Carnation Delivery on Valentines Day","73":"TICKETS FOR SALE - Streetlight Manifesto show in Hollywood House of Blues Thursday Oct 24 (x2)","74":"New Thrift Store in Goleta!","75":"We're giving away a free ticket to Cashmere Cat's show in Santa Barbara on Thurs 9\/19! Whoever enters the best explanation of why they should win will get the ticket!","76":"What are the music classes and groups like? (Trumpet and\/or Singing)","77":"Idea - Someone should make flyers and post around campus to advertise subreddit","78":"ACADEMIC EVENT: 'No F - Pass This Class' and 'How to Choose a Major'","79":"Van Jones (ex-green jobs advisor to the White House) coming to SBCC","80":"whats everyone doing this weekend?"},"selftext":{"0":"Hi! I'm a UCSB student currently trying to enroll in the online HIST 101 class taught by professor Mooney, but I need an add code in order to finish registering. I've sent the professor an email at [**mooneym@sbcc.edu**](mailto:mooneym@sbcc.edu), but I was wondering if anyone has\/has had his class, and have his office number or anything that I can dial. I don't want to be too behind in the course, so the sooner I can get registered, the better! If anyone can help me out, that would be great!","1":"[removed]","2":"I got up early to go to sbcc &amp; do the help with registering for classes lab but I found myself lost looking at my phone &amp; the online sbcc map &amp; kind of got anxiety from just walking around so I left. Anybody willing to show me around campus?","3":"just moved to sb for college &amp; im feeling homesick, any cool places i can check out? or places where people meet to maybe be a little more social? i’d appreciate anything(: thanks in advance \ni enjoy hikes so maybe even trails would be nice \n, i am a female though so make sure to give me a heads up if its not safe to hike alone lol, it looks beautiful here,  i dont know what the crime history is though, or if there is any","4":"[removed]","5":"hey guys SOOO im enrolled for the spring semester &amp; i start school in january, my major is law &amp; society- criminal justice &amp; my plan is to transfer to either ucsb or ucb maybe even chico state BUT with that being said, i need help registering for the correct classes. i need to make sure they’re transferable &amp; im a first time college student so im having a hard time. ive tried calling, emailing &amp; even left several voicemails to counselors so i can get some assistance but nothing... i want to register assp because i know classes fill up quick. im from norcal so i cant just drive and see a counselor sadly:( or i would! i’ve been stressing about this for a cool 2 weeks and really need some help, i did do an online webinar with a counselor but she was no help, it’s like she just wanted to be done with me even though she could tell i was confused and every time i had a question she would sound annoyed so it gave me a hard time to really focus on wtf it is she was telling me. she was so confusing that i even changed my major to philosophy bc she said something about how credits weren’t transferable with a law society major? idk im so confused and just need some guidance:( im a latina so nobody in my family has attended college and cant ask any of my cousins\/tias\/siblings","6":"The app is called Coursicle, it's on iOS and Android.","7":"\nPre-Registration Requirements and Holds\nNew Student Class Planning\tOct 15, 2019\tDec 31, 2019\n ^^^^^\nthis is what my pipeline is saying &amp; it says click a link below for more info but it just shows me a 404 how do i do my pre registration? \ni wanna move forward with my application for spring 2020 but im lost lol","8":"[removed]","9":"Need to gather information for a possible club I am gathering signatures for","10":"On SBCC And Their Lies: An Ugly Truth\n\n\nSanta Barbara City College has a core belief, that any person from any walk of life is welcome here. As altruistic as this may sound, there is a much more insidious truth lurking beneath the surface. This once beautiful campus has fallen into the disgusting clutches of the leftist horde. The very same people who bring over illegal immigrants who go on to commit serious crimes such as rape and murder. These people would have you share a table with these subhuman savages! They mock your heritage by saying that “you took our native lands”, and “men have no right to state their opinion cause muh uterus.” One only needs to look at “professor” Annette Cordero to realize the severity of the disease plaguing our campus. A common occurrence within her classroom is her constant berating of students for “taking her land,” as if they were at fault for her ancestors being weak-willed and ignorant. Trying to defend the pride of the Chumash is an uphill and losing battle all in one, seeing as how they truly have no pride or dignity to defend. With the highest rate of alcoholism in the country it is truly a shame that these are the same “people” that claim ownership over land that we conquered and won from them.  Her blatant bias towards liberal ideology is more than obvious when one takes a look at some of her course material. Even though we are only 2 weeks into the semester, she has already assigned 2 articles which claim that traditional gender norms are detrimental to a child's development. Ironic that she proclaims through her articles that she cares about children, when she is a staunch supporter of abortion. The norm of students agreeing with her drivel is more than worrisome, as I fear that my fellow classmates may have already fallen prey to the brainwashing and propaganda of the left. But Cordero is but a simple cyst among malignant tumors within the school and our society. One of these tumors is the obsession that the administration seems to have with coddling the illegal alien population within our campus. This filth is offered almost every single commodity at our school free of cost, while some of us have to pay full price because of these parasites taking up all our resources. So yes, these filthy animals are receiving free education at your expense my dear reader, seeing as how our taxes also go towards financial aid and improving the school. I myself once overheard a conversation between a financial aid official and an illegal where the official told him to “put less earned per year so that you get even more money”, per her own words. This same courtesy would not be offered to those of us who do not tick off enough diversity boxes I can promise you that.So not only are they aiding these illegals, they are also quite simply committing fraud! All just because the poor little savages need money to keep up their drug habits. Disgusting animals the lot of them. Well I say no more!  We must make a stand against this obvious invasion! We must band together and fight back against the bastardization of our once beautiful campus and country! The traitors in congress and Sacramento have time and time again shown that they don’t care about us one bit! It is time we remind all traitors, invaders and degenerates why there was a time in which they feared even showing their disgusting noses! You are not forgotten! You are not alone! Get out there and fight back! In every single way that you can! Remind the fools of their true place in society, at our feet! This is OUR home, OUR country! Long Live Washington! And Long Live America!","11":"I'm a student taking prerequisite grad school classes here after graduating with a BA from UCSB. Does anyone know if Transfer Advising offers graduate school admissions advising, e.g. help with personal statements?","12":"[removed]","13":"I go to UCSB. While I am not taking classes right now, I am here for the summer for an internship. I decided to take courses at SBCC courses because they are cheaper and they have Health\/Medicine Courses that are not offered at UCSB and that I can include in my medical school applications. I decided to take the courses online rather than in person because my internship is 9-5.\n\nOn my transcript, will the courses say that they were taken online?","14":"First time student at SBCC here! How or when do we know what kind of textbooks do we need for Summer 2 session? Their textbook website only refers to Summer 1 session.","15":"I am looking for a female student accommodation\/ summer sublease from mid may to mid Aug 2019 near SBCC. Anyone interested please dm.","16":"Anybody know when SBCC classes for the summer are released? Thanks","17":"I’m tired of just going to class and then going straight home to do my work and shit, I want to meet new people, but the list of clubs on the website seems pretty limited. Does anyone have any particular clubs that are interesting in mind, or any other ways of meeting new people here?\n\nThanks.","18":"https:\/\/docs.google.com\/forms\/d\/e\/1FAIpQLSeVwvDYToo0WgBa_Nsx_5ut5iB4wuOJjrhUdN_bWgRY2pY0BA\/viewform?usp=sf_link\n\nHi all, I went to community college myself and I'm working on a service to help community college students land internships they are passionate about.\n\nI made this quick survey to better understand what SBCC students need in terms of internships\/career help, so I can make a better service.\n\nWhen we get to 200 responses, we'll send a $50 Amazon gift card to one of you at random as a thank you (were at ~60 as of writing this) :)\n\nThank you so much for your input, really want to do some good here!","19":"I’m planning on coming in as a freshman next year and definitely won’t be knowing anyone, already saw that IV is the best place if I’m going for the full Santa Barbara experience ( which I def am ) but for someone who won’t be knowing anyone, got any recommendations on how to meet new freshman and upperclassmen besides people in my classes? ","20":"Santa Barbara City College has thousands of students, but it can be difficult to meet new people and stay in contact with them. With this in mind, I set up an unofficial Discord server for students (like me) and other people involved or interested in SBCC to meet each other, chat about their classes, and more.\n\nPlease respect other people on this server: harassment, discrimination, anti-semitism, religious intolerance, racism, threats, and spamming is NOT allowed.\n\n***\n\nTo join the server you will need a Discord account. You can sign up for Discord for free on their [website](https:\/\/discordapp.com\/). Once you've done that, follow this link to join the server: [https:\/\/discord.gg\/aqK43ZD](https:\/\/discord.gg\/aqK43ZD). Please introduce yourself in #introductions using the instructions in #rules. This helps keep the server SBCC-related and spam-free.\n\nPM me or comment below if you have questions or suggestions about the server.","21":"","22":"Hi guys, I am a graduate student in Psychology and I am working on a research project studying Student-Teacher Relationships in American High Schools. I’m looking for college-aged adults (18-24 years old) studying at SBCC to evaluate ideas for preventing these relationships from becoming romantic or sexual. I would be extremely grateful if you could take 15 minutes to complete this survey – and hopefully this research will help better education in the U.S.!\n\n[https:\/\/alliant.qualtrics.com\/jfe\/form\/SV\\_6LPDTk53rsjRmxn](https:\/\/alliant.qualtrics.com\/jfe\/form\/SV_6LPDTk53rsjRmxn)","23":"Text","24":"Would anyone on here be interested in a room at Tropicana Gardens, it is a short walk to the UCSB campus, has an on site cafe, and some activities to participate in. If you are interested or know anyone who is interested please message me!","25":"Hello, r\/SBCC! I've got a quick question...\n\nI'm visiting a friend in SB on the 10th of Sept. while also promoting my app that helps people throw parties for each other in exchange for money 🙂 It's called @zabzabapp.\n\nI'm trying to meet people that play a key role in the SBCC partying community and recruit hosts locally. How about a coffee\/beer some time next week to talk about the app? \n\nI'd love to hear your insights and discuss how we can start throwing parties for people in your area 🙂\n\nOur short explainer video: https:\/\/youtu.be\/pV3K5NIKQgE","26":"Anyone know what book is used for this","27":"","28":"I have to take a communication class to transfer to a CSU, does anyone have any recommendations on which one to take?","29":"","30":"The Independent Living Resource Center will be hosting a free group workshop on: June 30th 2018 for 14-24 year olds with disabilities\n\nIt will take place at 423 W Victoria St, Santa Barbara, CA 93101 from 10:30am-3:30pm\n\nIt is centrally located and close to public transit lines.\n\nThis location is wheelchair accessible. Activities, games, lunch, and snacks will be provided.\n\nThe workshop will cover topics such as:\n\nIndependence\/Independent Living Skills\n\nEmployment\n\nAdvocacy\n\nMentorship\n\nCommunity\n\nSystems Change\n\nHousing\n\nPost-Secondary Education\n\nILRC’s advocates will provide education on disability history and culture.There will be various agencies sharing information regarding services they offer.\n\nA mini tabling session will take place during lunch for attendees to learn more about various resources they might be interested in.\n\nPlease contact Alexa Martin at [amartin@ilrc-trico.org](mailto:amartin@ilrc-trico.org) for an application\n\nThis workshop is in a wheelchair accessible location and other accommodations will be provided upon request\n\nFeel free to call or email  with any other questions:\n\n(805) 650-5993 X202","31":"I have a friend in Isla Vista and it'd be cool if I could be near him, also I just love what I've seen and heard about that place. However I am not sure if it would be better to just get a place closer to SBCC (within walking distance maybe) and just take a bus whenever I wanna go out to IV. What do you guys think? ","32":"Hi, I’ve been having a really hard time with Deciding where I want to go after High School. I’ve worked so hard all four years and participated in so many extracurriculars and took so many AP classes, but unfortunately it wasn’t enough to get me to where I really wanted to be. I got rejected from all the UC’s that I really wanted to go to and surprisingly didn’t get into one CSU, and now I’ve just been in a slump and not sure where I really wanna go with my life and I have been wondering if maybe I’m not good enough for what I want to do, which is go into biological sciences and hopefully become an OB\/GYN. So now I’m stuck. I have an okay selection of schools, including: University of the Pacific, WSU, UC Merced, UC Santa Cruz, and  Azusa Pacific, but not where I can see myself going for four years or where I can be happy. So now I’m pretty sure that I’m going to go to SBCC, and try to do the TAG program to transfer to UCSB or UCI, but the only thing worrying me is if I’ll be able to get a 3.4 cumulative with biological sciences. I think I’m just wondering if it’s a guaranteed admission, why don’t a lot of people do it? Idk, I just need some guidence and help. ","33":"I’m in great need of help with some assignments!!","34":"Hey guys! My friends and I are five UBC students visiting California for our reading break. We'll be staying in Santa Barbara from Feb 20th to the 22nd and we were wondering if there was anything going on during that time. Any house party, frat party, event, anything that could make us say we experienced how american students have fun?\n\nWe're chill guys and we don't cause any problems... the stereotypical Canadian students!\n\nWe'd mean so much if to us you guys helped us getting involved in something!\n","35":"Hi there!\n\nI'm a prospective student from Singapore looking to enroll into SBCC so I can transfer later! Just finishing up my military service here and I'm hoping I can talk to some students about classes, campus, and SBCC in general over skype or something :) ","36":"","37":"","38":"I paid a parking citation just now that was keeping me from registering for classes, but when I go to register it still says I have that hold. Anyone have experience with this and know when it will let me register?","39":"Has anyone taken the EMT class at SBCC? I'm a 3rd year UCSB student and am looking to take the class. How long is it? When is it offered? How hard is it? Thanks.","40":"","41":"Take the question in any way you want. But what do you think about the social aspects of our school, the type of people that attend, etc. ","42":"","43":"Hi y'all.  I am 20 years old and currently enrolled in a community college in MA. Right now,  I am not happy with my current situation and just really want to start over I guess (long story short don't have any real close friends, the ones I had moved away,  family is pretty dysfunctional and our strained relationships, hate my current college, the weather in general drives me crazy and over all feel like I am just treading water with no real direction or tangible goals) My ~ideal plan would be to transfer to SBCC and eventually transfer to a UC school and earn my bachelors. It seems SBCC offers housing resources which isn't super expensive (well at least comparable to apartments in MA). I think SBCC would push me outside my comfort zone especially with their housing options and force me to make friends.  I also think being so far from home will force me to stand on my own two feet too.  Am I being realistic or totally crazy? How do I go about such a big move? I don't really have much guidance in my life so I guess that's why I am asking y'all.  Any advice would be much appreciated! Thanks in advance.  ","44":"","45":"So I will be working in Santa Barbara this summer. I've never been to Santa Barbara but I'm really excited to spend the summer there. I was wondering if there are a lot of sublets from SBCC during the summer that students tend to post. I don't know the area that much, and won't have a car but my work is close to SBCC so I figured this would be a good place to look. \n\nAs a side question how much does rent tend to run per month for a private room. I'm fine sharing a living space and bathroom. ","46":"I am looking to learn more about the class. ","47":"The Trivia Factory is currently seeking outgoing nerds, performers and know-it-alls to join our quiz hosting team and host weekly pub quizzes in Santa Barbara. Must have Tuesday evening availability.  Must also be over 21.\n\nCan you wield a mic with mad wit and read our questions with authority to a room full of players? Can you deal with the lifestyle: The quiz groupies, the media attention and living a celebrity lifestyle in your own mind? Just want to channel your inner Alex Trebek?\n\nPay: $50 per quiz per week. Quizzes last about 2 hours.\n\nFor more info or to apply visit http:\/\/www.thetriviafactory.com\/host-for-us\/.\n\nWe must have your online application before we can schedule interview. No need to email a resume. Trust me. We're not that formal. Questions? Contact me at here on reddit or at stephanie@thetriviafactory.com.","48":"Im trying to help out my friend who is planning on coming from japan and she wants to attend sbcc but doesn't know all the costs or if there is any aid. Anyone have any ideas?","49":"Hi\n\nWe are travelling to Cali in November and wants to ask you if it would be possible to join some nice parties at college? \n\n","50":"If you don't need it, please drop it for me, I really need it\nI'll give you 50 bucks if you drop it please","51":"I'm learning swedish (about A2\/B1 level right now maybe) and would love to have someone I could practice speaking with... I know there are a ton of swedish students at SBCC. I'd be happy to edit your papers in exchange. I study up at UC Berkeley, but I'm home in SB for the summer.","52":"If yes would you recommend sitting at the dorm or rent a house?","53":"","54":"I know this sub reddit is not very active but I'm just posting to see if anyone is willing to give me tips!\n\n\n\nI will be starting sbcc in a few months\n\n\n\nWhat tips do you have? How do you survive? ","55":"Hey guys, I'm coming to SBCC this coming fall. By this time, I will have 24 completed college credits, probably somewhere around 18-24 which are transferable to the UC system. Approximately 3.25 GPA. In any case, I plan on staying at SBCC two years and then transfering to UCSB, my dream school. \nI have narrowed down living into a few options and am curious about each one, but before I go into that I think it is fitting I give a short description of myself. During weekdays, I prefer to focus on school and maybe go out to eat or skate for a bit or just hangout with some friends, nothing to crazy. After I finish this work on the week, when the weekend comes I love to party, normally I go out Friday and Saturday night. I don't smoke weed but ocassionally willl at parties. At parties I also drink, but am not too big into just drinking for fun outside of a party. So in summary, I am a bit of a nerd on weekdays but when the weekend comes around I like to go hard at parties. Also, I have visited SB many times and would prefer to live in Isla Vista. I love the location, and I know it is a bit of a distance to SBCC, but Ive taken the bus and its not too bad from my point of view.\nSo, in any case, which of the following living situations would suit me best?:\nTropicana Gardens\nTropicana Villas (I have about 24 credits)\nFinding a house in isla vista with some other people and sharing it\n\nThanks.","56":"","57":"Hey guys! I am a fairly new salsera (been dancing for 6 months) , in search of other salseras\/salseros or bachateros\/bachateras! It would be really cool to start up a team\/club and compete. Let me know if this is a good idea! ","58":"Was wondering if anyone would be interested in starting a professional team here at SBCC? Hopefully with enough support we could even get the school to support us.","59":"","60":"Having issues with the BOG. What I want to do is drop the classes and turn in the BOG then reads them in order to renew the 72 hour payment deadline.","61":"Hi everyone! \n\n&amp;nbsp;\n\nA while ago, I announced StudyHut, an app which allows students to find other students within their college based on mutual courses. After a great beta testing phase, we have officially launched on the iOS App Store, go download it now! - [StudyHut iOS App](http:\/\/studyhutapp.com\/download)\n\n&amp;nbsp;\n\nIf you aren't familiar with it, StudyHut essentially resolves the issue of not knowing people in some of your classes. It makes it super easy to talk to your peers regarding the homework, midterms\/finals, or setup study session! We also have a [FaceBook page](http:\/\/facebook.com\/StudyHutApp). The next version will have the following features: \n\n&amp;nbsp;\n\n- Discussion board for each of your classes (everyone in the class can talk together about what's going on) \n\n- Group study sessions: Users can create study sessions that others can view and join. \n\n&amp;nbsp;\n\nYour support is greatly appreciated, please feel free to provide any feedback! If you're an Android developer, get in touch with us :) . \n\n&amp;nbsp;\n\nOur official website: http:\/\/studyhutapp.com ","62":"Wondering how the team is cause I might like to play","63":"Hey guys. So as the title says, I signed up for one class in the Summer I session, and two classes for the Summer II session. On Pipeline, however, I was only able to pay for two classes from the second summer session). I'm nearing the end of the period where if you don't pay you get dropped, but I don't know how to pay for the last class. Does anyone have any sort of insight on this? I was going to call today, but completely forgot, and tomorrow will likely be too late. I'm not sure why I can't pay for the first Summer Session. Any help would be appreciated, thanks!","64":"I'm an 18y\/o senior In high school plannig on going to sbcc in the fall I was just wondering if this applies to me?","65":"What apartments has a large amount of SBCC\/UCSB undergrads? I'm hoping to go to SBCC for Fall and the Trops are far too expensive. Any ideas?","66":"hey guys so I'm coming down to Santa Barbara to visit for spring break and I'm wondering which bars would be okay to use my fake ID. unfortunately I don't turn 21 till until this june. are there any bars that are known for being relaxed with that type of thing?  ","67":"This subreddit is dead... where are all my fellow sbcc t\nredditors","68":"I lost my puppy","69":"","70":"","71":"So my parents have been hovering for pretty much this whole process so I had to put alcohol free down. Do people take that seriously? I have to be honest, I'm not living in IV to play water pong and drink gatorade...","72":"","73":"I bought two tickets for a Streetlight Manifesto show in the Hollywood House of Blues. Unfortunately I am unable to make it and so am selling my tickets. These **2** tickets were printed by Ticketmaster and snail-mailed to me. **$25** each.","74":"","75":"","76":"I am a UCSB student considering playing music at SBCC. I play trumpet and sing.  What are the classes\/groups and what do I do to be in them?\n\nExamples of types of groups I'd be interested in\n\n* Wind Ensemble\n\n* Brass Ensemble\n\n* any ensemble with a trumpet spot\n\n* Chorus\n\n* Women's Choir   \n\n* a cool group where you can learn a new instrument","77":"I'm not in Santa Barbara right now or I would do it ","78":"October 10 - 14 from 11a - 1pm in Friendship Plaza (East Campus)\n\nNOTE - Both campaigns are taking place at the same time in the same place.\n\n**\"No F - Pass This Class\" campaign:**\n\n1)  We will be providing students with information about campus resources that can help them to turn their “F” grades to passing grades.\n\n2)  We will be providing students with information about success strategies that students can use to turn their “F” grades around and do well in their classes.  Students will then apply these success strategies to their own lives by writing out action statements that they will commit to doing.  Student Success Counselors will be on hand to give feedback about their goal statements and make recommendations and\/or referrals if needed.\n\n3)  We will have fun learning activities and prizes for students who join the activities.\n \n**\"How to Choose a Major\":** \n\nSelecting an academic major is one of the most significant decisions students will make at Santa Barbara City College.  As students start this journey, they may feel eager or overwhelmed by the many possibilities that await them.  However they feel, counselors from the Career Center recognize the importance of this decision and are here to offer assistance.  Come join Career Center Counselors at Friendship Plaza from October 10 - 14 from 11:00am—1:00pm to learn more about the major selection and career decision-making process. ","79":"Courtesy of Dr Adam Green:\n\nThe Center for Sustainability is a major co-sponsor of an upcoming event with Van Jones \"Green For All, The Next American Economy.\" Attached is a poster that you can send out to your students. Van is a very inspirational speaker and this would be a great opportunity for students.\n\nSaturday Oct 29th; 7:00-8:30pm: Marjorie Luke Theater 721 East Cota St.; $10 students, $20 general public.\n\nVan Jones Biography\nOur country is in the depths of an economic recession and ecological crisis. We need nine million new jobs in the United States. They must be jobs that can support families and jobs that do no harm to the environment. America needs her best minds generating smart and innovative ideas to create more jobs. Van Jones is one of those people.\n\nVan Jones is a globally recognized, award-winning pioneer in human rights and the clean-energy economy. He is the best-selling author of the definitive book on green jobs: The Green-Collar Economy. He served as the green jobs advisor in the Obama White House in 2009.\n\nVan is currently a senior fellow at the Center For American Progress. Additionally, he is a senior policy advisor at Green For All.\n\nVan also holds a joint appointment at Princeton University, as a distinguished visiting fellow in both the Center for African American Studies and in the Program in Science, Technology and Environmental Policy at the Woodrow Wilson School of Public and International Affairs.\n\nThe Clean-Energy Economy\nVan is the founder of Green For All, the national organization working to get green jobs to disadvantaged communities. He was the main advocate for the Green Jobs Act, which George W. Bush signed into law in 2007. The Act was the first piece of federal legislation to codify the term \"green jobs.\" Under the Obama administration, it has resulted in $500 million for green job training nationally.\n\nHuman Rights\nWhile best known for his promotion of green jobs, Van has been hard at work for nearly two decades, fashioning solutions to some of urban America's toughest problems. In addition to Green For All, he is the co-founder of two social justice organizations: the Ella Baker Center for Human Rights and Color of Change.\n\nAwards &amp; Honors\nVan's work has earned him many awards and honors, including:\nVan was named by TIME Magazine as one of the 100 most influential people in the world in 2009.\nVan was designated by the World Economic Forum as a \"Young Global Leader.\"\nVan is a recipient of the international Ashoka Fellowship.\nVan was one of Essence Magazine's 25 most inspiring African Americans in 2008. Last year, Ebony Magazine named him one of the Power 150.\n\nBoards\nVan is on the board of several organizations and non-profits, including:\nDemos\nNational Resources Defence Council\nRFK Memorial\nCampaign For America's Future","80":"I'm bored."},"comments":{"0":["Glad I could help!! Mooneys a great professor and as long as you do the work in his class you will get an A!","Just wanted to let you know, that this helped so much and I was able to reach him, as well as successfully add the class!!! Thank you! (:","How cute! (':","I saw a :( so heres an :) hope your day is good","Since it's an online class, I think I would need a code (not sure how to crash for that). :( The class has open spots, I just can't access the course yet until I register!","Thank you so, so much! I've texted that number just now and I'll try to leave a voicemail as well. I hope I will hear a reply from him sometime soon! (:","That, and try crashing his class if you cant get a code","Communication (instructor will reply within 24 hours, M- F):\nText or voicemail @: (805) 699-5117\n\nOffice hours: Wednesdays from 9:30 am - 11 am in WCC 132 and via Zoom, by appointment."],"1":[],"2":["Thank you!","Friday I will be on campus and more than happy to help."],"3":["Sure thing! Another place that’s fun to explore is Elwood. It’s out in Goleta right by IV and it’s this huge place overlooking the ocean. Probably my favorite spot in town","thank you!!!","Wilcox preserve is nearby campus and is a cool place to walk around but isn’t really a hike. It overlooks the beach and a lot of people walk their dogs there which can be fun\n\nSome of my favorite nearby hikes though would be to inspiration point or the gaviota wind caves. Lizards mouth is also amazing if you’re looking for a great view","Hey! I’ve been going through the same thing. Wanna text? I’m a female as well and I’ve been wanting to go on a hike too!"],"4":[],"5":[],"6":[],"7":["I believe you can also do the appointment online so that you don’t have to drive all the way down since you mentioned you’re from NorCal","Exactly, you need to make an academic plan with a counselor. Call ahead and make a appointment","new student class planning is the hold... im from norcal so does this mean i go meet with a counselor","Check under: Student &gt; Student Records &gt; View Pre-Registration Requirements and Holds. It'll tell you the hold type"],"8":[],"9":["oh cool. well the club closed down after 10 people came for for the first meeting,  2 for the second, and after that nobody showed up","My friends and I learned some during high school."],"10":["Just wait and see :) tick tock","We get it, you hate Mexicans... America is melting pot and that’s never going to change.","Fuck off"],"11":[],"12":[],"13":["BMS 146, and HIT 135. I took them all online, I think I put that in my original post. I couldn't take them in person because I had a full time research position plus full course load at UCSB.\n\nWhy do you ask?","Glad to be of help!  Did you take BMS (Biomedical Sciences) 107—Human Anatomy—the 4 unit course— during the summer?  Quite rigorous, especially during the summer session!  \n  Or, did you take the online:  BMS 146 -- Human Form and Function?     \n\n\nIn the fall, did you take the 3-unit \"HIT (Health Information Technology) 135\" online class?  Or did you take the \"in-person, 1-unit class\", AH (Allied Health) 120—Medical Terminology class?   Just curious.","Haha thanks, this was a while ago so I already took the class and got the transcript. I took Anatomy in the Summer and Medical Terminology in the Fall.","The answer is:  \"No;  on your transcript (unofficial and official), there is no indication as regards to whether or note the course was taken or offered on an \"online basis\", \"classroom basis\" , or \"hybrid\" basis \\[yes, such classes do exist at SBCC and elsewhere!\\].  Hope that reassures you!\n\nBy the way, out of curiosity , may I ask:  \"What are the particular \"health\/medicine courses\" at SBCC to which you are referrring?","I took an online class last year. On my unofficial transcript it doesn’t distinguish between online and at campus courses","When I went there, they weren't. It just said whether they were taken for credit or pass\/no pass"],"14":["In the first 1-2 days of class you will know exactly what books to buy. pretty easy","I see, I see that sounds music to my ears. I go to SFSU and textbooks means everything lol get it to do assignments or get dropped. Ouch.","books are the least important thing abouts class lol dont worry bout it"],"15":[],"16":["Most of the schedules is already finalized. From what I hear a couple departments are making some final changes and tweets. They should have the schedule up in about a week or two. Registration will probably open up 3 weeks after that. It will start with people that have priority registration and start opening up to the general campus about a week or two after that. Check the school's website for registration dates."],"17":[],"18":[],"19":["cringe"],"20":[],"21":[],"22":[],"23":[],"24":[],"25":[],"26":["Fosho thanks","CNEE 120 - Introduction to Cybersecurity: the website says that the book is  \n\n&gt;**Comptia Security+ Gde To Network Security Fundamentals**   \n&gt;  \n&gt; ISBN 9781337288781 \n\nYou can also email the Prof to ask him his email is\n\n [**el-soussi@sbcc.edu**](mailto:el-soussi@sbcc.edu) \n\n&amp;#x200B;\n\nGOOD LUCK on the class and tell me how it goes i am think of taking now since i now know it exist."],"27":[],"28":["Public speaking (131) was a great experience and very useful in my opinion!! You only speak in front of your class so it’s not bad at all !","Yes I took comm 121 this summer I believe that is the required class to transfer to any state school in California. Dm me if you have anymore questions "],"29":[],"30":[],"31":["If you won't have a car, I'd recommend living closer to CC. There's an \"express\" bus from IV area to SBCC, but I've heard from others it can take up to an hour still.","Yeah I wont have a car. I will be walking or taking the bus my entire time there. I cant afford another car in Cali","I think that person just drives really slow, it is *absolutely not* a 30 minute drive on a good day. Without traffic, you're looking at an approximately 15 minute drive. I've done it in 12 minutes before. There are times where traffic is randomly heavy and that can make it take 30 minutes, but that's not normal.\n\nThe commute itself is fine, the problem with driving to SBCC is the parking situation. It can be pretty difficult to find a spot, particularly at the start of a semester. I went to SBCC for 3 years all while living in IV, the commute is a piece of cake. You just gotta \n\n1) leave early enough to give yourself time to find parking\n\n2) know where all of the parking lots are\n\n3) carpool with someone. There are special parking lots that you can only use if you carpool. I used to carpool with my roommate to CC at around 10am and I almost always found a spot in the carpool lots right when I got there.\n\n4) know places to park that are off campus in case the parking situation is really bad. Sometimes parking off campus and walking the rest of the way is faster than just driving around looking for a spot. \n\nAnd while I'm talking about parking, it can be very difficult to find a parking spot in IV at night unless you have a reserved parking spot.\n\n\nThat said, if I could go back in time and do it again, I would probably have just stayed in IV for my first year and then moved to the mesa or some other place that is actually normal. IV can be fun and all but I was sick of all of the fuckery that goes on there by the time I had lived there for 1.5 years, but that first year I lived there was super fun. Living in IV is just too much once you're used to it, especially when you've got an 8am class the next day and your upstairs neighbors won't turn down the fucking music. I'm not saying that will be your exact situation, but it was mine for a long time; people just make too much noise in IV. People blast music too much, people get into yelling matches in the streets at 2am too much, people break beer bottles in the streets too much, people rev their loud ass cars at stop signs at 2am too much. Living in a place with a lesser concentration of college students means you will naturally deal with the above scenarios less often. It's just not a great place to live when there are so many other options in SB\/Goleta.\n\nSome people can't get enough of it, maybe that will be you. I'm one of the people that got sick of it. One great thing about living in IV is that it can allow for you to get the complete \"college experience\" even though you're a CC student, that's the case with me. I lived at Tropicana Gardens my first year, so I basically got the same dorming experience that a UCSB student would get by staying at the UC dorms. My first year of IV was one of the best years of my life. Getting to experience IV as a newcomer was a blast, there are tons of food places to walk to even late at night, and almost all of the other freshmen just wanna drink and have fun. I'm not sure if you're an incoming freshman or what, I'm just giving my story. But after a bit you get sick of eating in IV, the people will get annoying, and you'll wanna live someplace that doesn't have young drunk people running around all the time.\n\nThe city of Santa Barbara has so much to offer, it's a wonderful place to be and I hope I can find a job there and return someday. Don't think that you will be missing out on the fun just because you don't live in IV.","It depends on what you want from the experience. Downtown is definitely cheaper and closer but that's really if you're here to focus on school only. But at that point, why not go to CC in your hometown \\(imo anyway\\)? If you really want a taste of the area \\(especially if you are going to transfer to UCSB after\\) I'd recommend living on 67 block \\(DP, Sabado, Pasado, etc.\\) in IV. The reason why is because it's far enough from UCSB campus to get you really cheap rent but a nice place, while still being relatively close to other students\/IV ","In my opinion that's a much better option. Buena Vista, Cliff House, and The Ivy are pretty nice and close to campus ","Oh screw that I think I'll just go to IV on certain days then. (probably for the better anyway)","From IV to campus on a good day is 30 mins, on a bad traffic day more like 45","How bads the commute between the two?","If you're coming to party, shoot for IV. If you want easy access to campus and downtown, there's a couple solid apartments real close that will be much better for that. "],"32":["The guarantee requires the GPA. SBCC is almost like a feeder school into UCSB so you can just apply and probably get in after a few years at SBCC. Biology also has a really gnarly class sequence and amount of required classes so be ready! Keep your GPA up and get involved in extra circulars obviously, Santa Barbara’s fuckin awesome","I’m not an expert but I believe SBCC has a program that guarantees acceptance to certain UCs if you follow it and pass your classes. I’m sure that Bio sciences is involved because they announced this in my marine bio class. I recommend going and speaking to a counselor there, they are very helpful and have helped many people in your position. There are also excellent scholarships available. Good luck!"],"33":[],"34":[],"35":["Definitely do it! The international community here is really great and there's tons of good opportunities for students at your fingertips. Not to mention the college, campus, and city of Santa Barbara are amazing. "],"36":["Don't take it with Amy Thompson!! Trust me","It's only offered during the school year. Very inconvenient."],"37":["I found it very hard to be honest. I took it with Chang and idk, I had to study around 2 hours everyday for the class. I thought 150 was much easier.","Yea if you take it with Chang"],"38":["Lol, I literally just had this happen to me. The hold clears immediately.","If it doesn't clear by Sunday you need to go to administration office for clearance on Monday."],"39":[],"40":[],"41":["It’s kinda hard to make friends. It seems like less of a community than most 4 years. But it’s not impossible. Especially if you go to parties "],"42":["In reddit"],"43":["Hey man I'm 18 and moving out there from Madison WI for pretty similar reason. It's not crazy but the adventure will be, WERE HEADED TO PARADISE BABAY! SBCC is top tier 2 year college it's a great choice even if you were happy in MA but it's understandably anxiety provoking moving across the country to new cultures and climates. Let me know if this helps "],"44":[],"45":["I'm in the same boat as well! I'll be working in downtown so the closest college is SBCC. \n\nHave you tried looking at craigslist and had any luck with it?"],"46":[],"47":[],"48":["This should have all the info you need about cost and financial aid: http:\/\/www.sbcc.edu\/financialaid\/index.php"],"49":[],"50":["Meet me at the starbucks on De La guerra"],"51":[],"52":["not really a dorm, but there is Beach City, an apartment complex basically in the middle of campus. google it","http:\/\/www.sbcc.edu\/housing\/index.php"],"53":["Classes start the end of august. No scores needed, you just apply online.","I meant when do classes start? By the beginning of which month?... And thanks for the website ","I'm not quite sure what the first question is after, but this should help:\n\nhttp:\/\/www.sbcc.edu\/prospective\/"],"54":["Actually im a US citizen but i live at Egypt thats why my English ain't that good. So would it differ?","It looks like you are an international student. This website will be helpful: [http:\/\/international.sbcc.edu\/apply\/](http:\/\/international.sbcc.edu\/apply\/)","When does the courses work and what are the required procedure for applying? Is there is specific score requirement?","More specific questions would be easier to answer. Tips about what? How to survive what?"],"55":["LOL Don't live in Trop, I've heard horror stories about it. But check out the Sweeps and CBC! Ask for Victor Rodriguez, he'll show you around and help you out. GL!"],"56":[],"57":["My pleasure, hope that helps :)","Thank you!","Welcome to the family!  Hope your search goes well.  If you're looking for some free ways to up your skill level (or go through as a team) Salsarias Dance Co. has published a free course on the 5 basics of Salsa.  We'd appreciate feedback!\nsalsarias.teachable.com"],"58":[],"59":[],"60":[],"61":[],"62":[],"63":[],"64":["Dual enrollment is when a student is still in high school and is taking one or more SBCC classes."],"65":["I'm still looking for roommates since every has flaked so far. What is your budget and pm me some info about yourself so we can make sure we're a goodfit to actually live iwth each other!","I'm looking for a rooomate as a freshman as well \nIs there any room for me to look with you still?\nI've done everything expect pay yet because I want to be sure I have a place to stay first.\nIf so I'd have to travel up there to finalize stuff about it\/meet you\/look because I'm about an hour away.","We're thinking of this apartment near SBCC in Bath St. It's a great deal and isn't out of the way. Going to the school will help you meet people already. Everywhere is near the beach so you won't have to worry about all that.  ","[deleted]","I still am, you interested?","[deleted]","Yes! Where are you transferring from?","Still looking? I know this thread was a month ago but I'm planning to transfer to sbcc for the fall semester and looking for roommates :-)","Beach city is 800 a bed and a 1200 deposit but they'll take any1. its basically shared apartments for students. People like it though, very friendly atmosphere and pools on site. (80 dollars for month for parking though) :(\nsbcc.edu\/housinglist and craigslist are the best for looking for places. People are already posting for fall roommates on craigslist.\n\nYou'll really enjoy SBCC. Beautiful campus, great classes and ridiculous amount of hot girls ;) ","Yes I am! Pm me if you're still interested !","Yo! I'm gonna be a freshman at SBCC in the fall :D \n\nI'm also interested in housing options! Are you looking for potential room mates? ","I wouldn't expect to find to much variance in price considering what you are looking for. Any housing specifically targeted at college students is expensive.","That was the plan anyways!","That was the plan anyways!","I do but I cant talk right now. Would you mind just using the messaging?","Orchid house is extremely overpriced and it looks isolated from other students besides its residents. Do you have a skype?","Looks like we're all in the same boat. I've been looking at a lot of the apartments that are listed on the SBCC website, and it seems like the orchid house is the best option because it is specifically catered towards students, and it has a meal plan. I don't know for sure though, I'll be visiting in April to make a decision.","haha great! I'll pm you.","Ive been fishing my enture life i love it\n\nNaw im pretty laissez faire about everything honestly, i wouldnt be offebded in the least","I fish with my uncle a lot. I was hoping to have a roommate who likes fishing. What do you mean when you say politics? Because I'm not really into that so I don't care about what happens really. I hope that won't like offend you.","Yup","Fishing?  Are you from NorCal?","Reading \n\nFishing \n\nCooking \n\nVolunteering \n\nPolitics \n\nVideo games \n\nHiking \n\nListening to NPR\n\nIll go to parties if ones going on, but im not super into them ","So your hobbies buddy? ","That would be good \n\nMurder is generally a bad idea","i posted this on another thread and they gave me some ideas . We could share a rent together if you're chill. But ya know we gotta find out if we won't kill each other after a week","Thats the plan","Are you coming there as a freshman?","in the same boat here, planning on going in the fall aswell."],"66":["Do not go to Tonic, EOS, Sandbar, or Sharkeez. Anything else is still a risk, but those places are known to take your ID and call the cops."],"67":["Finally.. its about time lol .. not very many reddittors at sbcc i guess","I'm here"],"68":[],"69":[],"70":[],"71":[],"72":[],"73":[],"74":[],"75":[],"76":[],"77":[],"78":[],"79":["I can see how that could be an issue!","I have yet to arrive.","You're going to be away?","God damnit, I would've loved to attend this."],"80":[]},"category":{"0":"None","1":"None","2":"None","3":"None","4":"None","5":"None","6":"None","7":"None","8":"None","9":"None","10":"None","11":"None","12":"None","13":"None","14":"None","15":"None","16":"None","17":"None","18":"None","19":"None","20":"None","21":"None","22":"None","23":"None","24":"None","25":"None","26":"None","27":"None","28":"None","29":"None","30":"None","31":"None","32":"None","33":"None","34":"None","35":"None","36":"None","37":"None","38":"None","39":"None","40":"None","41":"None","42":"None","43":"None","44":"None","45":"None","46":"None","47":"None","48":"None","49":"None","50":"None","51":"None","52":"None","53":"None","54":"None","55":"None","56":"None","57":"None","58":"None","59":"None","60":"None","61":"None","62":"None","63":"None","64":"None","65":"None","66":"None","67":"None","68":"None","69":"None","70":"None","71":"None","72":"None","73":"None","74":"None","75":"None","76":"None","77":"None","78":"None","79":"None","80":"None"},"id":{"0":"ep5nnx","1":"eoq9en","2":"elwzog","3":"ek69vx","4":"e9lkvn","5":"e7o5bi","6":"e7jw7e","7":"dzo0hb","8":"dbxmn2","9":"d10qom","10":"d0k7nt","11":"czqu7x","12":"cx3f44","13":"cauybo","14":"c0gu47","15":"bn90wz","16":"atjkyy","17":"ak7oa3","18":"ajkqkz","19":"a9wr10","20":"a5y7hz","21":"a3ogyb","22":"9s5e4u","23":"9o1iyn","24":"9nuq4e","25":"9cv2sh","26":"99v4nj","27":"923zie","28":"91pxj0","29":"8zspgw","30":"8t0nyp","31":"8l735o","32":"8bey3f","33":"8bd3p0","34":"7w3gjd","35":"7ujflq","36":"7mqlai","37":"7lxljq","38":"7h0mms","39":"7bp31u","40":"7bb11u","41":"6dbots","42":"6a6mdb","43":"687x9o","44":"62tg5n","45":"5u3rg7","46":"5tx5p5","47":"5i540r","48":"58l7ct","49":"533se6","50":"4xluo8","51":"4pqk8h","52":"4k7vrt","53":"4iitdp","54":"4cdgu5","55":"48gbzu","56":"48fi55","57":"3pjqlg","58":"3m0ny3","59":"3ii3vu","60":"3ev19d","61":"38uxlc","62":"36c1ra","63":"33nyzt","64":"330vca","65":"2y4n02","66":"2xxids","67":"2ube3q","68":"2u4fjz","69":"2oub8i","70":"2fpeia","71":"29f81x","72":"1x8ag1","73":"1oyq2f","74":"1n7axa","75":"1lmrbw","76":"1fs7ec","77":"11remn","78":"l1zbk","79":"kxkks","80":"kwu8a"},"created_utc":{"0":1579110865,"1":1579030986,"2":1578509586,"3":1578189529,"4":1576143840,"5":1575773775,"6":1575752519,"7":1574362801,"8":1569954948,"9":1567885962,"10":1567793056,"11":1567631380,"12":1567096995,"13":1562640669,"14":1560493833,"15":1557555939,"16":1550852987,"17":1548554117,"18":1548386045,"19":1545892253,"20":1544738459,"21":1544107209,"22":1540751007,"23":1539509433,"24":1539445772,"25":1536063556,"26":1535092620,"27":1532624052,"28":1532506090,"29":1531891932,"30":1529667687,"31":1526961614,"32":1523427445,"33":1523407785,"34":1518078880,"35":1517498555,"36":1514506190,"37":1514150779,"38":1512189011,"39":1510181328,"40":1510031006,"41":1495738692,"42":1494348481,"43":1493446233,"44":1491061232,"45":1487113810,"46":1487036055,"47":1481652615,"48":1477020605,"49":1474055824,"50":1471134893,"51":1466821586,"52":1463745419,"53":1462785743,"54":1459217719,"55":1456838125,"56":1456824705,"57":1445376625,"58":1442975739,"59":1440616600,"60":1438058475,"61":1433639726,"62":1431922718,"63":1429840635,"64":1429360278,"65":1425643189,"66":1425492796,"67":1422722498,"68":1422565564,"69":1418193028,"70":1410077835,"71":1404078553,"72":1391733990,"73":1382427733,"74":1380229147,"75":1378195458,"76":1370515564,"77":1350672560,"78":1317839713,"79":1317487015,"80":1317414306}}